ConvergingDivergingNozzle/OpenFOAM-2.3.0/nozzle-hex-struct/0/cellDist
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      cellDist;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
225900
(
3
3
3
3
3
3
3
3
...
)
;

boundaryField
{
    nozzle-walls
    {
        type            zeroGradient;
    }
    symmetry-plane
    {
        type            symmetryPlane;
    }
    vert-outlet
    {
        type            zeroGradient;
    }
    horiz-outlet
    {
        type            zeroGradient;
    }
    left-walls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
