ConvergingDivergingNozzle/OpenFOAM-2.3.0/nozzle-hex-struct/0/mut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      mut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.0;
    }
    
    #include "emptySymmetry.include"
    
    vert-outlet
    {
        type            zeroGradient;
    }
    
    horiz-outlet
    {
        type            zeroGradient;
    }
    
    left-walls
    {
        type            mutkWallFunction;
        Cmu             0.09;
	kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    
    nozzle-walls
    {
        type            mutkWallFunction;
        Cmu             0.09;
	kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
}


// ************************************************************************* //



